// AboutMe.js
import React from 'react';

const AboutMe = () => {
  return (
    <section>
      <header className="flex items-center">
        <h1 className="font-semibold text-lg md:text-2xl text-green-800 mb-4">За мен</h1>
      </header>
      <article className="border shadow-sm rounded-lg bg-gradient-to-r from-green-50 to-blue-50 p-4">
        <p>
          Привет!
          <br></br>
          Аз съм Тихомир, ученик от 12 клас в ТУЕС и съм на 18 години. Обичам да се занимавам с програмиране, да пътувам с влак и да се забавлявам с приятели.
          <br></br>
          Това е моето портфолио, в което можете да намерите повече информация за мен, моите проекти и моите умения. Надявам се да ви хареса!
          <br></br>
          Малко повече за мен:
          <br></br>
          Роден съм в едно малко, изключително красиво село на име Антон. През 2019 г. идвам в София, за да преоткрия света. :) Започвам да уча в ТУЕС, където се влюбвам в програмирането.
          Още от малък харесвам компютрите и технологиите, но не съм подозирал, че е толкова забавно. Сега, 5 години по-късно не съжалявам за избора си да бъда в ТУЕС.
          Това е най-уникалното училище! Срещна ме със страхотни хора и промени коренно живота ми. 
          <br></br>
          Освен програмирането, в ТУЕС преоткрих и доброволчеството. Винаги ми е било приятно да помагам, да се включвам навсякъде и да създавам нещо ново.
          Благодарение на АЗТУЕС в момента съм горд член на училищния подкаст - TUES Talks! Участвал съм като доброволец в много събития на ТУЕС и това ми е донесло
          изключителни емоции. 
          <br></br>
          Освен влаковете, програмирането и доброволчеството, имам интерес и в телевизията. Миналата година (2023г.) участвах в няколко телевизионни предавания по
          Българската Национална Телевизия. Това беше едно невероятно преживяване, което ми даде много нови познания и опит.
        </p>
        </article>
    </section>
  );
};

export default AboutMe;
